[

  {
    "title": "Method of Relaxation",
    "github": "https://github.com/Jim-Shaddix/Method-Of-Relaxation",
    "image": "images/project-images/relax.png",
    "description": ["This is a web dashboard I developed that uses the Method of Relaxation for",
                    "approximating solutions to laplace's partially differential equation.",
                    "This dashboard can be used to visualize the potential between",
                    "a system of capacitors."],
    "live": "https://method-of-relaxation.herokuapp.com",
    "heroku": true
  },

  {
    "title": "Neutron Scattering Dashboard",
    "github": "https://github.com/Jim-Shaddix/Neutron-Scattering-Dashboard",
    "image": "images/project-images/Neutron-Scattering.png",
    "description": ["This is a web dashboard I developed that allows users to interactively ",
                    "view results from a Neutron Scattering Experiment. Functionally, the application",
                    "allows for users to specifiy a sweeping direction, and",
                    "interactively displays cross sections of a heatmap. The",
                    "heatmap displays Neutron intensity data."]
  },

  {
    "title": "Lorentzian Peak Analyzer",
    "github": "https://github.com/Jim-Shaddix/rus-probe",
    "image": "images/project-images/RUS.png",
    "description": ["This is a program I developed for finding, tracking, and fitting",
                    "Lorentzian peaks in data. This program allows the user to interactively",
                    "preprocess data, and modify the parameters used for",
                    "performing peak operations. I developed this application for doing data",
                    "analysis and visualization on experiments that make use of Resonant",
                    "Ultransonic Spectroscopy."]
  },

  {
    "title": "Bulk Rename",
    "github": "https://github.com/Jim-Shaddix/bulkrename",
    "image": "images/project-images/bulkrename.png",
    "description": ["This is a command line application that allows for a user to bulk rename files using an editor such as vim!",
                    "Why waste time writing scripts to rename files when you can use",
                    "this program in conjunction with bulk text editing tools",
                    "in your favorite editor?!"]
  },

  {
    "title": "Random Forest From Scratch",
    "github": "https://github.com/Jim-Shaddix/Random-Forest-In-Python",
    "image": "images/project-images/random-forest.png",
    "description": ["This application consists of a Jupyter Notebook I developed that gives",
    "a detailed explanation on how Random Forests work. I developed the Random Forest algorithm",
    "using the Python libraries Numpy and Pandas. In this notebook, I show how the algorithm can be used to investigate",
    "the relationship between personality types and substance abuse."]
  },

  {
    "title": "Personal Website",
    "github": "https://github.com/Jim-Shaddix/Personal-Website",
    "image": "images/project-images/personal-website.png",
    "description": ["This is the website that you are currently looking at!",
    "I developed this website using Bootstrap for the frontend, and Python's ",
    "Flask framework with Jinja2 templating for the backend. The program runs ",
    "on the AWS LightSail service using the nginx webserver and the gunicorn ",
    "application server."]
  },
  {
    "title": "Parallelized Decision Tree",
    "github": "https://github.com/Jim-Shaddix/Parallelized-Decision-Tree",
    "image": "images/project-images/parallelized-decision-tree.png",
    "description": ["This is a final project that I developed for a class on",
    "parallel programming. For this project, I developed three different",
    "implementations of the decision tree algorithm in C++, and analyzed the performance",
    "of each of the algorithms using Python. I than wrote a report comparing the",
    "runtime performance of each of my implementations under different thread counts",
    "that explains the observed behavior."]
  }

]
